sbwx/tele-sketch/components/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
    void writeBytes(int spi_host, const uint8_t* data, size_t len)
    {
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      if (len > 64) len = 64;
      memcpy(reinterpret_cast<void*>(SPI_W0_REG(spi_port)), data, (len + 3) & ~3);
      writereg(SPI_MOSI_DLEN_REG(spi_port), (len << 3) - 1);
      writereg(SPI_CMD_REG(      spi_port), SPI_EXECUTE);
      while (*reg(SPI_CMD_REG(spi_port)) & SPI_USR);
    }

    void readBytes(int spi_host, uint8_t* data, size_t len)
    {
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      if (len > 64) len = 64;
      memcpy(reinterpret_cast<void*>(SPI_W0_REG(spi_port)), data, (len + 3) & ~3);
      writereg(SPI_MOSI_DLEN_REG(spi_port), (len << 3) - 1);
      writereg(SPI_CMD_REG(      spi_port), SPI_EXECUTE);
      while (*reg(SPI_CMD_REG(spi_port)) & SPI_USR);

      memcpy(data, reinterpret_cast<const void*>(SPI_W0_REG(spi_port)), len);
    }
  }

//----------------------------------------------------------------------------
  static constexpr const int __DECLARE_RCC_ATOMIC_ENV = 0;

  namespace i2c
  {
#if __has_include( <core_version.h> )
  #include <core_version.h>
#endif

#if !defined ( I2C_ACK_ERR_INT_RAW_M )
 #define I2C_ACK_ERR_INT_RAW_M I2C_NACK_INT_RAW_M
#endif

    __attribute__ ((unused))
    static periph_module_t getPeriphModule(int num)
    {
#if SOC_I2C_NUM == 1 || defined CONFIG_IDF_TARGET_ESP32C6
      return PERIPH_I2C0_MODULE;
#else
      return num == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE;
#endif
    }

    static i2c_dev_t* getDev(int num)
    {
#if SOC_I2C_NUM == 1 || defined CONFIG_IDF_TARGET_ESP32C6
      return &I2C0;
#else
      return num == 0 ? &I2C0 : &I2C1;
#endif
    }

#if defined ( I2C_CLOCK_SRC_ATOMIC )
    __attribute__ ((unused))
    static void i2c_periph_enable(int i2c_num)
    {
      I2C_RCC_ATOMIC() {
        i2c_ll_enable_bus_clock(i2c_num, true);
        i2c_ll_reset_register(i2c_num);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
      I2C_CLOCK_SRC_ATOMIC() {
        i2c_ll_enable_controller_clock(I2C_LL_GET_HW(i2c_num), true);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }

    __attribute__ ((unused))
    static void i2c_periph_disable(int i2c_num)
    {
      // periph_ll_disable_clk_clear_rst(mod);
      I2C_CLOCK_SRC_ATOMIC() {
        i2c_ll_enable_controller_clock(I2C_LL_GET_HW(i2c_num), false);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
      I2C_RCC_ATOMIC() {
        i2c_ll_enable_bus_clock(i2c_num, false);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }

    __attribute__ ((unused))
    static void i2c_periph_reset(int i2c_num)
    {
      I2C_RCC_ATOMIC() {
        i2c_ll_reset_register(i2c_num);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }
#else
    __attribute__ ((unused))
    static void i2c_periph_enable(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_enable(mod);
    }

    __attribute__ ((unused))
    static void i2c_periph_disable(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_disable(mod);
    }

    __attribute__ ((unused))
    static void i2c_periph_reset(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_reset(mod);
    }
#endif

#if defined ( CONFIG_IDF_TARGET_ESP32 ) || defined ( CONFIG_IDF_TARGET_ESP32S2 ) || !defined ( CONFIG_IDF_TARGET )

    static void updateDev(i2c_dev_t* dev)
    {
    }
    static volatile uint32_t* getFifoAddr(int num)
    {
      return (volatile uint32_t*)((num == 0) ? 0x6001301c : 0x6002701c);
    }

    static constexpr int i2c_cmd_start = 0;
    static constexpr int i2c_cmd_write = 1;
    static constexpr int i2c_cmd_read  = 2;
    static constexpr int i2c_cmd_stop  = 3;
    static constexpr int i2c_cmd_end   = 4;

#else

    static void updateDev(i2c_dev_t* dev)
    {
      dev->ctr.conf_upgate = 1;
    }
    static volatile uint32_t* getFifoAddr(int num)
    {
#if defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 )
      return &(getDev(num)->data.val);
#else
      return &(getDev(num)->fifo_data.val);
#endif
    }

    static constexpr int i2c_cmd_start = 6;
    static constexpr int i2c_cmd_write = 1;
    static constexpr int i2c_cmd_read  = 3;
    static constexpr int i2c_cmd_stop  = 2;
    static constexpr int i2c_cmd_end   = 4;

#endif

    static constexpr int I2C_7BIT_ADDR_MIN = 0x08;
    static constexpr int I2C_7BIT_ADDR_MAX = 0x77;
    static constexpr int I2C_10BIT_ADDR_MAX = 1023;
    struct i2c_context_t
    {
      enum state_t
      {
        state_disconnect,
        state_write,
        state_read
      };
      cpp::result<state_t, error_t> state;

      SemaphoreHandle_t mtx = nullptr;

      void lock(uint32_t msec = portMAX_DELAY) {
        if (mtx == nullptr) {
          mtx = xSemaphoreCreateMutex();
        }
        xSemaphoreTake(mtx, msec);
      }

      void unlock(void) {
        xSemaphoreGive(mtx);
      }

      gpio_num_t pin_scl = (gpio_num_t)-1;
      gpio_num_t pin_sda = (gpio_num_t)-1;
      uint8_t wait_ack_stage = 0;   // 0:Not waiting. / 1:Waiting after addressing. / 2:Waiting during data transmission.
      bool initialized = false;
      uint32_t freq = 0;

      void save_reg(i2c_dev_t* dev)
      {
        auto reg = (volatile uint32_t*)dev;
#if defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 )
        auto fifo_reg = (volatile uint32_t*)(&dev->data);
#else
        auto fifo_reg = (volatile uint32_t*)(&dev->fifo_data);
#endif
        for (size_t i = 0; i < sizeof(_reg_store) >> 2; ++i)
        {
          if (fifo_reg == &reg[i]) { continue; }
          _reg_store[i] = reg[i];
        }
      }

      void load_reg(i2c_dev_t* dev)
      {
        auto reg = (volatile uint32_t*)dev;
#if defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 )
        auto fifo_reg = (volatile uint32_t*)(&dev->data);
#else
        auto fifo_reg = (volatile uint32_t*)(&dev->fifo_data);
#endif
        for (size_t i = 0; i < sizeof(_reg_store) >> 2; ++i)
        {
          if (fifo_reg == &reg[i]) { continue; }
          reg[i] = _reg_store[i];
        }
        updateDev(dev);
      }

      void setPins(i2c_dev_t* dev, gpio_num_t scl, gpio_num_t sda)
      {
        pin_sda = sda;
        pin_scl = scl;
#if defined ( ARDUINO ) && __has_include (<Wire.h>)
 #if defined ( ESP_IDF_VERSION_VAL )
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
   #if defined ARDUINO_ESP32_GIT_VER
    #if ARDUINO_ESP32_GIT_VER != 0x44c11981
     #define USE_TWOWIRE_SETPINS
    #endif
   #endif
  #endif
 #endif

