sbwx/tele-sketch/components/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
      static constexpr uint32_t intmask = I2C_ACK_ERR_INT_RAW_M | I2C_TIME_OUT_INT_RAW_M | I2C_END_DETECT_INT_RAW_M | I2C_ARBITRATION_LOST_INT_RAW_M;
      auto fifo_addr = getFifoAddr(i2c_port);
      auto dev = getDev(i2c_port);

      size_t len = 0;
#if defined ( CONFIG_IDF_TARGET_ESP32S3 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 )
      uint32_t us_limit = ((dev->scl_high_period.scl_high_period + dev->scl_high_period.scl_wait_high_period + dev->scl_low_period.scl_low_period) << 1);
#elif defined ( CONFIG_IDF_TARGET_ESP32C3 )
      uint32_t us_limit = ((dev->scl_high_period.period + dev->scl_low_period.period) << 1);
#else
      uint32_t us_limit = (dev->scl_high_period.period + dev->scl_low_period.period);
#endif
      do
      {
        res = i2c_wait(i2c_port);
        if (res.has_error())
        {
          ESP_LOGV("LGFX", "i2c read error : ack wait");
          break;
        }

        len = length < 32 ? length : 32;
        length -= len;

        i2c_set_cmd(dev, 2, i2c_cmd_end, 0, false);
        i2c_set_cmd(dev, 1, i2c_cmd_end, 0, false);
        bool flg_nack = (last_nack && length == 0);
        i2c_set_cmd(dev, 0, i2c_cmd_read, len - (flg_nack ? 1 : 0), false);
        if (flg_nack) {
          i2c_set_cmd(dev, (len == 1) ? 0 : 1, i2c_cmd_read, 1, true);
        }
        updateDev(dev);
        dev->int_clr.val = intmask;
        dev->ctr.trans_start = 1;

        uint32_t us = lgfx::micros();
        taskYIELD();
        int delayus = ((us_limit + 2) >> 2) - (lgfx::micros() - us);
        if (delayus > 0) {
          delayMicroseconds(delayus);
        }
        do
        {
          us = lgfx::micros();
          do
          {
            taskYIELD();
          } while ((len>>1) >= getRxFifoCount(dev) && !(dev->int_raw.val & intmask) && ((lgfx::micros() - us) <= us_limit + 1024));

          if (0 == getRxFifoCount(dev))
          {
            i2c_stop(i2c_port);
            ESP_LOGW("LGFX", "i2c read error : read timeout");
            res = cpp::fail(error_t::connection_lost);
            i2c_context[i2c_port].state = cpp::fail(error_t::connection_lost);
            i2c_context[i2c_port].wait_ack_stage = 0;
            return res;
          }
          *readdata++ = *fifo_addr;
        } while (--len);
      } while (length);

      return res;
    }

    cpp::result<void, error_t> transactionWrite(int i2c_port, int addr, const uint8_t *writedata, uint8_t writelen, uint32_t freq)
    {
      cpp::result<void, error_t> res;
      if ((res = beginTransaction(i2c_port, addr, freq, false)).has_value()
      )
      {
        res = writeBytes(i2c_port, writedata, writelen);
      }
      auto last = endTransaction(i2c_port);
      return res.has_error() ? res : last;
    }

    cpp::result<void, error_t> transactionRead(int i2c_port, int addr, uint8_t *readdata, uint8_t readlen, uint32_t freq)
    {
      cpp::result<void, error_t> res;
      if ((res = beginTransaction(i2c_port, addr, freq, true)).has_value()
      )
      {
        res = readBytes(i2c_port, readdata, readlen, true);
      }
      auto last = endTransaction(i2c_port);
      return res.has_error() ? res : last;
    }

    cpp::result<void, error_t> transactionWriteRead(int i2c_port, int addr, const uint8_t *writedata, uint8_t writelen, uint8_t *readdata, size_t readlen, uint32_t freq)
    {
      cpp::result<void, error_t> res;
      if ((res = beginTransaction(i2c_port, addr, freq, false)).has_value()
       && (res = writeBytes(i2c_port, writedata, writelen)).has_value()
       && (res = restart(i2c_port, addr, freq, true)).has_value()
      )
      {
        res = readBytes(i2c_port, readdata, readlen, true);
      }
      auto last = endTransaction(i2c_port);
      return res.has_error() ? res : last;
    }

    cpp::result<uint8_t, error_t> readRegister8(int i2c_port, int addr, uint8_t reg, uint32_t freq)
    {
      auto res = transactionWriteRead(i2c_port, addr, &reg, 1, &reg, 1, freq);
      if (res.has_value()) { return reg; }
      return cpp::fail( res.error() );
    }

    cpp::result<void, error_t> writeRegister8(int i2c_port, int addr, uint8_t reg, uint8_t data, uint8_t mask, uint32_t freq)
    {
      uint8_t tmp[2] = { reg, data };
      if (mask)
      {
        auto res = transactionWriteRead(i2c_port, addr, &reg, 1, &tmp[1], 1, freq);
        if (res.has_error()) { return res; }
        tmp[1] = (tmp[1] & mask) | data;
      }
      return transactionWrite(i2c_port, addr, tmp, 2, freq);
    }




    enum pin_index_t {
      SEARCH_SCL_IDX,
      SEARCH_SDA_IDX,
      PIN_SCL_IDX,
      PIN_SDA_IDX,
    };

    i2c_temporary_switcher_t::i2c_temporary_switcher_t(int i2c_port, int pin_sda, int pin_scl)
    : _i2c_port { i2c_port }
    {
#if defined ( I2C0_SDA_PAD_IN_IDX )
 #define I2CEXT0_SDA_IN_IDX I2C0_SDA_PAD_IN_IDX
 #define I2CEXT0_SCL_IN_IDX I2C0_SCL_PAD_IN_IDX
 #if defined ( I2C1_SDA_PAD_IN_IDX )
  #define I2CEXT1_SDA_IN_IDX I2C1_SDA_PAD_IN_IDX
  #define I2CEXT1_SCL_IN_IDX I2C1_SCL_PAD_IN_IDX
 #endif
#endif

      int peri_sig_sda = I2CEXT0_SDA_IN_IDX;
      int peri_sig_scl = I2CEXT0_SCL_IN_IDX;
#if defined (I2CEXT1_SDA_IN_IDX)
      if (i2c_port != 0) {
        peri_sig_sda = I2CEXT1_SDA_IN_IDX;
        peri_sig_scl = I2CEXT1_SCL_IN_IDX;
      }
#endif
      int search_sda = search_pin_number(peri_sig_sda);
      int search_scl = search_pin_number(peri_sig_scl);

      if (search_sda != pin_sda || search_scl != pin_scl) {
        _backuped = true;
        if (pin_sda >= 0 || pin_scl >= 0) {
          _pin_backup[PIN_SDA_IDX].setPin(pin_sda);
          _pin_backup[PIN_SDA_IDX].backup();
          _pin_backup[PIN_SCL_IDX].setPin(pin_scl);
          _pin_backup[PIN_SCL_IDX].backup();
        }
        if (search_sda >= 0 || search_scl >= 0) {
#if defined ( ARDUINO ) && __has_include (<Wire.h>)
          _twowire = nullptr;
          if (search_sda >=0 && search_scl >= 0) {
#if defined ( ARDUINO ) && __has_include (<Wire.h>) && defined ( ESP_IDF_VERSION_VAL )
 #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  #if defined ARDUINO_ESP32_GIT_VER
    #if ARDUINO_ESP32_GIT_VER != 0x44c11981
            _twowire = &Wire;
#if defined (I2CEXT1_SDA_IN_IDX)
            if (i2c_port != 0) { _twowire = &Wire1; }
#endif
            _twowire->end();
    #endif
  #endif
 #endif
#endif
          }
#endif
          i2c::release(_i2c_port);
          _pin_backup[SEARCH_SDA_IDX].setPin(search_sda);
          _pin_backup[SEARCH_SCL_IDX].setPin(search_scl);
          _pin_backup[SEARCH_SDA_IDX].backup();
          _pin_backup[SEARCH_SCL_IDX].backup();
          _need_reinit = true;
        }
        i2c::init(_i2c_port, pin_sda, pin_scl);
      }
    }

    void i2c_temporary_switcher_t::restore(void) {
      if (_backuped) {
        i2c::release(_i2c_port);
        for (auto &b : _pin_backup) {
          b.restore();
        }
        // if (sda >= 0 && scl >= 0) {
        if (_need_reinit) {
          int sda = _pin_backup[SEARCH_SDA_IDX].getPin();
          int scl = _pin_backup[SEARCH_SCL_IDX].getPin();
#if defined ( ARDUINO ) && __has_include (<Wire.h>)
          if (_twowire) {
            _twowire->begin(sda, scl);
          }
#endif
          i2c::init(_i2c_port, sda, scl);
        }
      }
    }

  }

//----------------------------------------------------------------------------
 }
}

#endif
